app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("carrier", "created_at", "name", "phone_num", "updated_at") VALUES (?, ?, ?, ?, ?)  [["carrier", "Verizon"], ["created_at", Mon, 30 Mar 2015 21:00:54 UTC +00:00], ["name", "Eric Martz"], ["phone_num", 6788590929], ["updated_at", Mon, 30 Mar 2015 21:00:54 UTC +00:00]]
---
  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save

UPDATE "contacts" SET "carrier" = ?, "updated_at" = ? WHERE "contacts"."id" = 1  [["carrier", "AT&T"], ["updated_at", Tue, 07 Apr 2015 00:18:37 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @contact.update(contact_params)