app/controllers/messages_controller.rb

INSERT INTO "messages" ("created_at", "message_body", "updated_at") VALUES (?, ?, ?)  [["created_at", Mon, 30 Mar 2015 21:23:01 UTC +00:00], ["message_body", "Test"], ["updated_at", Mon, 30 Mar 2015 21:23:01 UTC +00:00]]
SELECT "contacts".* FROM "contacts"
---
  def create
    @message = Message.new(message_params)

    respond_to do |format|
      if @message.save
        @contacts = Contact.all

DELETE FROM "messages" WHERE "messages"."id" = ?  [["id", 2]]
---
  def destroy
    @message.destroy

SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", "980190962"]]
---
    def set_message
      @message = Message.find(params[:id])